### development Part # 1
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/37845207-9ff2-4ca8-981e-c2d95803787c/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.gateway[0] has been deleted
  - resource "aws_eip" "gateway" {
      - allocation_id        = "eipalloc-09dfa344439aa55d1" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-09dfa344439aa55d1" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-52-1-57-195.compute-1.amazonaws.com" -> null
      - public_ip            = "52.1.57.195" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags_all             = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "Cashewhands"
          - "Project"       = "ECS-Deep-Dive"
          - "Purpose"       = "Further deploy ECS to AWS"
          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          - "Team"          = "Cashewhands"
          - "Terraform"     = "true"
        } -> null
      - vpc                  = true -> null
    }

  # aws_eip.gateway[1] has been deleted
  - resource "aws_eip" "gateway" {
      - allocation_id        = "eipalloc-07f1102a6dc4f6ec6" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-07f1102a6dc4f6ec6" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-34-201-156-137.compute-1.amazonaws.com" -> null
      - public_ip            = "34.201.156.137" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags_all             = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "Cashewhands"
          - "Project"       = "ECS-Deep-Dive"
          - "Purpose"       = "Further deploy ECS to AWS"
          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          - "Team"          = "Cashewhands"
          - "Terraform"     = "true"
        } -> null
      - vpc                  = true -> null
    }

  # aws_nat_gateway.gateway[0] has been deleted
  - resource "aws_nat_gateway" "gateway" {
      - allocation_id        = "eipalloc-09dfa344439aa55d1" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-07e07f885fa478672" -> null
      - network_interface_id = "eni-01175fe35481a26fa" -> null
      - private_ip           = "10.20.2.177" -> null
      - public_ip            = "52.1.57.195" -> null
      - subnet_id            = "subnet-03dd553c149ce28f8" -> null
      - tags_all             = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "Cashewhands"
          - "Project"       = "ECS-Deep-Dive"
          - "Purpose"       = "Further deploy ECS to AWS"
          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          - "Team"          = "Cashewhands"
          - "Terraform"     = "true"
        } -> null
    }

  # aws_nat_gateway.gateway[1] has been deleted
  - resource "aws_nat_gateway" "gateway" {
      - allocation_id        = "eipalloc-07f1102a6dc4f6ec6" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0e38576384e410195" -> null
      - network_interface_id = "eni-01c05b4a808cc2662" -> null
      - private_ip           = "10.20.3.93" -> null
      - public_ip            = "34.201.156.137" -> null
      - subnet_id            = "subnet-05876db757a534a17" -> null
      - tags_all             = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "Cashewhands"
          - "Project"       = "ECS-Deep-Dive"
          - "Purpose"       = "Further deploy ECS to AWS"
          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          - "Team"          = "Cashewhands"
          - "Terraform"     = "true"
        } -> null
    }

  # aws_security_group.load_balancer_sg has been deleted
  - resource "aws_security_group" "load_balancer_sg" {
      - id                     = "sg-03e265d2494035d0f" -> null
        name                   = "alb-sg"
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[0] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-03dd553c149ce28f8"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public[1] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-05876db757a534a17"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "worker"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_eip.gateway[0] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_eip.gateway[1] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_flow_log.vpc-fl must be replaced
-/+ resource "aws_flow_log" "vpc-fl" {
      ~ arn                      = "arn:aws:ec2:us-east-1:012119841372:vpc-flow-log/fl-01bf5ca5a47567c6e" -> (known after apply)
      + iam_role_arn             = "arn:aws:iam::012119841372:role/cashewhands-vpc-fl" # forces replacement
      ~ id                       = "fl-01bf5ca5a47567c6e" -> (known after apply)
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      + log_group_name           = (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

  # aws_lb.application_load_balancer will be created
  + resource "aws_lb" "application_load_balancer" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "Cashews-development-alb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-03dd553c149ce28f8",
          + "subnet-05876db757a534a17",
        ]
      + tags_all                   = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_nat_gateway.gateway[0] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-03dd553c149ce28f8"
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_nat_gateway.gateway[1] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-05876db757a534a17"
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0b82a4619ca77baa7"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-07e07f885fa478672"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
            # (1 unchanged element hidden)
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06ce90c6e3c75b28c"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0e38576384e410195"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
            # (1 unchanged element hidden)
        ]
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.load_balancer_sg will be created
  + resource "aws_security_group" "load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = " security group to allow inbound/outbound from the VPC to Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound access"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow 443 from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow 80 from anywhere for redirection"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = "vpc-0bc18e836485a83de"
    }

Plan: 8 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_eip.gateway[0] has been deleted%0A  - resource "aws_eip" "gateway" {%0A      - allocation_id        = "eipalloc-09dfa344439aa55d1" -> null%0A      - domain               = "vpc" -> null%0A      - id                   = "eipalloc-09dfa344439aa55d1" -> null%0A      - network_border_group = "us-east-1" -> null%0A      - public_dns           = "ec2-52-1-57-195.compute-1.amazonaws.com" -> null%0A      - public_ip            = "52.1.57.195" -> null%0A      - public_ipv4_pool     = "amazon" -> null%0A      - tags_all             = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A      - vpc                  = true -> null%0A    }%0A%0A  # aws_eip.gateway[1] has been deleted%0A  - resource "aws_eip" "gateway" {%0A      - allocation_id        = "eipalloc-07f1102a6dc4f6ec6" -> null%0A      - domain               = "vpc" -> null%0A      - id                   = "eipalloc-07f1102a6dc4f6ec6" -> null%0A      - network_border_group = "us-east-1" -> null%0A      - public_dns           = "ec2-34-201-156-137.compute-1.amazonaws.com" -> null%0A      - public_ip            = "34.201.156.137" -> null%0A      - public_ipv4_pool     = "amazon" -> null%0A      - tags_all             = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A      - vpc                  = true -> null%0A    }%0A%0A  # aws_nat_gateway.gateway[0] has been deleted%0A  - resource "aws_nat_gateway" "gateway" {%0A      - allocation_id        = "eipalloc-09dfa344439aa55d1" -> null%0A      - connectivity_type    = "public" -> null%0A      - id                   = "nat-07e07f885fa478672" -> null%0A      - network_interface_id = "eni-01175fe35481a26fa" -> null%0A      - private_ip           = "10.20.2.177" -> null%0A      - public_ip            = "52.1.57.195" -> null%0A      - subnet_id            = "subnet-03dd553c149ce28f8" -> null%0A      - tags_all             = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A    }%0A%0A  # aws_nat_gateway.gateway[1] has been deleted%0A  - resource "aws_nat_gateway" "gateway" {%0A      - allocation_id        = "eipalloc-07f1102a6dc4f6ec6" -> null%0A      - connectivity_type    = "public" -> null%0A      - id                   = "nat-0e38576384e410195" -> null%0A      - network_interface_id = "eni-01c05b4a808cc2662" -> null%0A      - private_ip           = "10.20.3.93" -> null%0A      - public_ip            = "34.201.156.137" -> null%0A      - subnet_id            = "subnet-05876db757a534a17" -> null%0A      - tags_all             = {%0A          - "Backup"        = "false"%0A          - "Environment"   = "development"%0A          - "Product-Owner" = "Cashewhands"%0A          - "Project"       = "ECS-Deep-Dive"%0A          - "Purpose"       = "Further deploy ECS to AWS"%0A          - "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          - "Team"          = "Cashewhands"%0A          - "Terraform"     = "true"%0A        } -> null%0A    }%0A%0A  # aws_security_group.load_balancer_sg has been deleted%0A  - resource "aws_security_group" "load_balancer_sg" {%0A      - id                     = "sg-03e265d2494035d0f" -> null%0A        name                   = "alb-sg"%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.public[0] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-03dd553c149ce28f8"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.public[1] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-05876db757a534a17"%0A      + tags                                           = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.ecr will be created%0A  + resource "aws_ecr_repository" "ecr" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "worker"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "KMS"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_eip.gateway[0] will be created%0A  + resource "aws_eip" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_eip.gateway[1] will be created%0A  + resource "aws_eip" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_flow_log.vpc-fl must be replaced%0A-/+ resource "aws_flow_log" "vpc-fl" {%0A      ~ arn                      = "arn:aws:ec2:us-east-1:012119841372:vpc-flow-log/fl-01bf5ca5a47567c6e" -> (known after apply)%0A      + iam_role_arn             = "arn:aws:iam::012119841372:role/cashewhands-vpc-fl" # forces replacement%0A      ~ id                       = "fl-01bf5ca5a47567c6e" -> (known after apply)%0A      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)%0A      + log_group_name           = (known after apply)%0A      - tags                     = {} -> null%0A        # (6 unchanged attributes hidden)%0A%0A      - destination_options {%0A          - file_format                = "plain-text" -> null%0A          - hive_compatible_partitions = false -> null%0A          - per_hour_partition         = false -> null%0A        }%0A    }%0A%0A  # aws_lb.application_load_balancer will be created%0A  + resource "aws_lb" "application_load_balancer" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = true%0A      + enable_deletion_protection = false%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 60%0A      + internal                   = false%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "Cashews-development-alb"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = [%0A          + "subnet-03dd553c149ce28f8",%0A          + "subnet-05876db757a534a17",%0A        ]%0A      + tags_all                   = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_nat_gateway.gateway[0] will be created%0A  + resource "aws_nat_gateway" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = "subnet-03dd553c149ce28f8"%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_nat_gateway.gateway[1] will be created%0A  + resource "aws_nat_gateway" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = "subnet-05876db757a534a17"%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_route_table.private[0] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-0b82a4619ca77baa7"%0A      ~ route            = [%0A          - {%0A              - carrier_gateway_id         = ""%0A              - cidr_block                 = "0.0.0.0/0"%0A              - core_network_arn           = ""%0A              - destination_prefix_list_id = ""%0A              - egress_only_gateway_id     = ""%0A              - gateway_id                 = ""%0A              - instance_id                = ""%0A              - ipv6_cidr_block            = ""%0A              - local_gateway_id           = ""%0A              - nat_gateway_id             = "nat-07e07f885fa478672"%0A              - network_interface_id       = ""%0A              - transit_gateway_id         = ""%0A              - vpc_endpoint_id            = ""%0A              - vpc_peering_connection_id  = ""%0A            },%0A            # (1 unchanged element hidden)%0A        ]%0A        tags             = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_route_table.private[1] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-06ce90c6e3c75b28c"%0A      ~ route            = [%0A          - {%0A              - carrier_gateway_id         = ""%0A              - cidr_block                 = "0.0.0.0/0"%0A              - core_network_arn           = ""%0A              - destination_prefix_list_id = ""%0A              - egress_only_gateway_id     = ""%0A              - gateway_id                 = ""%0A              - instance_id                = ""%0A              - ipv6_cidr_block            = ""%0A              - local_gateway_id           = ""%0A              - nat_gateway_id             = "nat-0e38576384e410195"%0A              - network_interface_id       = ""%0A              - transit_gateway_id         = ""%0A              - vpc_endpoint_id            = ""%0A              - vpc_peering_connection_id  = ""%0A            },%0A            # (1 unchanged element hidden)%0A        ]%0A        tags             = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.load_balancer_sg will be created%0A  + resource "aws_security_group" "load_balancer_sg" {%0A      + arn                    = (known after apply)%0A      + description            = " security group to allow inbound/outbound from the VPC to Load Balancer"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow outbound access"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow 443 from anywhere"%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow 80 from anywhere for redirection"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "alb-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                 = "vpc-0bc18e836485a83de"%0A    }%0A%0APlan: 8 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*